Revit 2026 API

# ElementHasPhases Method

---

Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HasPhases()
```
```vb
Public Function HasPhases As Boolean
```
```cpp
public:
bool HasPhases()
```
```fsharp
member HasPhases : unit -> bool
```

#### Return Value

Boolean True if this Element has the properties CreatedPhaseId and DemolishedPhaseId, false otherwise.

Acts as a validator for setting the properties CreatedPhaseId and DemolishedPhaseId.

#### Reference

Element Class

Autodesk.Revit.DB Namespace